# IndexPrimitive Class

---
The base class for index buffer primitives.
SystemObject Autodesk.Revit.DB.DirectContext3DIndexPrimitive Autodesk.Revit.DB.DirectContext3DIndexLine Autodesk.Revit.DB.DirectContext3DIndexPoint Autodesk.Revit.DB.DirectContext3DIndexTriangle
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IndexPrimitive : IDisposable

    Public Class IndexPrimitive
    	Implements IDisposable

    public ref class IndexPrimitive : IDisposable

    type IndexPrimitive =
        class
            interface IDisposable
        end
The IndexPrimitive type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IndexPrimitive
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.DirectContext3D Namespace